tests/fixtures/signedWebpayPlus.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
    <ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
        <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
        <ds:Reference URI="#pfx218d8797-3e68-da88-e52a-2d877f598c64"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>42wTy5Me1YzNoWz9GXP0RYgdefY=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>tGFM9NpBnKz6bQpErHDmu36FDvDEQpQB0CSuOKBItSEjy/xkuLJYob8GbpVcqDnXt5sNemAu9ujHsC/qXbeOBNUqqFUndcZhfGdBct1bM5pWqsBoBEeC9X3U6f3q4g0kFs6TAr6qyEHdUcGmNlHvc5ujdDmpxY4vrawkWR4Wdm6/N91gRwPDuhJAQNFkTsvy9Xph4l3SPmSXtPQAt8Yu5sRaPxK7FaObNYHzzJ8wd/mhX0x2VLe3i8u/vjdEhQ3W09n8dFYnoD9pxyTjjuYtQQ2HAUTnlC6jnNozLoA2vsHOnFlOM3Qs+AF9aN5SWAS006NZDOqEeVU5wf+a2M7E8Q==</ds:SignatureValue>
</ds:Signature></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="pfx218d8797-3e68-da88-e52a-2d877f598c64"><ns1:initTransaction><wsInitTransactionInput><wSTransactionType>TR_NORMAL_WS</wSTransactionType><returnURL>http://test.dev/response</returnURL><finalURL>http://test.dev/thanks</finalURL><transactionDetails><amount>10000</amount><commerceCode>597020000541</commerceCode><buyOrder>Orden824201</buyOrder></transactionDetails></wsInitTransactionInput></ns1:initTransaction></SOAP-ENV:Body></SOAP-ENV:Envelope>