spec/support/xml/acknowledge_transaction/request_unsigned.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.wswebpay.webpay.transbank.com/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Body>
        <tns:acknowledgeTransaction>
            <tokenInput>nxBdsbdSPixMZsIajOJWyg2OklTBcXXiW1rxnSpi9fCg1sMaxay4xWMuYV0fTUay</tokenInput>
        </tns:acknowledgeTransaction>
    </env:Body>
</env:Envelope>